FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_LM3S811_IAR/LuminaryCode/gpio.c
        /* */
        /* Disable the interrupts. */
        /* */
        HWREG( ulPort + GPIO_O_IM ) &= ~( ucPins );
    }
#endif /* if defined( GROUP_pinintdisable ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Gets interrupt status for all the pins of the selected GPIO port. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param bMasked specifies whether masked or raw interrupt */
/*! status is returned */
/*! */
/*! If \e bMasked is set as \b true, then the masked interrupt status is */
/*! returned; otherwise, the raw interrupt status will be returned. */
/*! */
/*! \return Returns a bit-packed byte, where each bit that is set identifies */
/*! an active masked or raw interrupt, and where bit 0 of the byte */
/*! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, etc. Bits */
/*! 31:8 should be ignored. */
/* */
/****************************************************************************** */
#if defined( GROUP_pinintstatus ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    long GPIOPinIntStatus( unsigned long ulPort,
                           tBoolean bMasked )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Return the interrupt status. */
        /* */
        if( bMasked )
        {
            return( HWREG( ulPort + GPIO_O_MIS ) );
        }
        else
        {
            return( HWREG( ulPort + GPIO_O_RIS ) );
        }
    }
#endif /* if defined( GROUP_pinintstatus ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Clears the interrupt for the specified pins of the selected GPIO port. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! */
/*! Clears the interrupt for the specified pins. */
/*! */
/*! The pins are specified using a bit-packed byte, where each bit that is */
/*! set identifies the pin to be accessed, and where bit 0 of the byte */
/*! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, etc. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_pinintclear ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPinIntClear( unsigned long ulPort,
                          unsigned char ucPins )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Clear the interrupts. */
        /* */
        HWREG( ulPort + GPIO_O_ICR ) = ucPins;
    }
#endif /* if defined( GROUP_pinintclear ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Registers an interrupt handler for the selected GPIO port. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param pfIntHandler pointer to the GPIO port interrupt handling function */
/*! */
/*! This function will ensure that the interrupt handler specified by \e */
/*! pfIntHandler is called when an interrupt is detected from the selected */
/*! GPIO port. This function will also enable the corresponding GPIO */
/*! interrupt in the interrupt controller; individual pin interrupts and */
/*! interrupt sources must be enabled with GPIOPinIntEnable(). */
/*! */
/*! \sa IntRegister() for important information about registering interrupt */
/*! handlers. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_portintregister ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPortIntRegister( unsigned long ulPort,
                              void ( * pfIntHandler )( void ) )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Get the interrupt number associated with the specified GPIO. */
        /* */
        ulPort = GPIOGetIntNumber( ulPort );

        /* */
        /* Register the interrupt handler. */
        /* */
        IntRegister( ulPort, pfIntHandler );

        /* */
        /* Enable the GPIO interrupt. */
        /* */
        IntEnable( ulPort );
    }
#endif /* if defined( GROUP_portintregister ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Removes an interrupt handler for the selected GPIO port. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! */
/*! This function will unregister the interrupt handler for the specified */
/*! GPIO port.  This function will also disable the corresponding */
/*! GPIO port interrupt in the interrupt controller; individual GPIO interrupts */
/*! and interrupt sources must be disabled with GPIOPinIntDisable(). */
/*! */
/*! \sa IntRegister() for important information about registering interrupt */
/*! handlers. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_portintunregister ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPortIntUnregister( unsigned long ulPort )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Get the interrupt number associated with the specified GPIO. */
        /* */
        ulPort = GPIOGetIntNumber( ulPort );

        /* */
        /* Disable the GPIO interrupt. */
        /* */
        IntDisable( ulPort );

        /* */
        /* Unregister the interrupt handler. */
        /* */
        IntUnregister( ulPort );
    }
#endif /* if defined( GROUP_portintunregister ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Reads the values present at the specified pins of the selected GPIO port. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! */
/*! The values at the specified pins are read, as specified by \e ucPins. */
/*! Values are returned for both input and output pins, and the value */
/*! for pins that are not specified by \e ucPins are set to 0. */
/*! */
/*! The pins are specified using a bit-packed byte, where each bit that is */
/*! set identifies the pin to be accessed, and where bit 0 of the byte */
/*! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, etc. */
/*! */
/*! \return Returns a bit-packed byte providing the state of the specified */
/*! pin, where bit 0 of the byte represents GPIO port pin 0, bit 1 represents */
/*! GPIO port pin 1, etc. Any bit that is not specified by \e ucPins */
/*! is returned as a 0. Bits 31:8 should be ignored. */
/* */
/****************************************************************************** */
#if defined( GROUP_pinread ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    long GPIOPinRead( unsigned long ulPort,
                      unsigned char ucPins )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Return the pin value(s). */
        /* */
        return( HWREG( ulPort + ( GPIO_O_DATA + ( ucPins << 2 ) ) ) );
    }
#endif /* if defined( GROUP_pinread ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Writes a value at the specified pins of the selected GPIO port. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! \param ucVal value to write to the specified pins */
/*! */
/*! Writes the corresponding bit values to the output pins specified */
/*! by \e ucPins. Writing to a pin configured as an input pin has no */
/*! effect. */
/*! */
/*! The pins are specified using a bit-packed byte, where each bit that is */
/*! set identifies the pin to be accessed, and where bit 0 of the byte */
/*! represents GPIO port pin 0, bit 1 represents GPIO port pin 1, etc. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_pinwrite ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPinWrite( unsigned long ulPort,
                       unsigned char ucPins,
                       unsigned char ucVal )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Write the pins. */
        /* */
        HWREG( ulPort + ( GPIO_O_DATA + ( ucPins << 2 ) ) ) = ucVal;
    }
#endif /* if defined( GROUP_pinwrite ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Configures pin(s) for use as an analog comparator input. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! */
/*! The analog comparator input pins must be properly configured for the analog */
/*! comparator to function correctly.  This function provides the proper */
/*! configuration for those pins. */
/*! */
/*! \note This cannot be used to turn any pin into an analog comparator input; */
/*! it only configures an analog comparator pin for proper operation. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_pintypecomparator ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPinTypeComparator( unsigned long ulPort,
                                unsigned char ucPins )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Make the pin(s) be inputs. */
        /* */
        GPIODirModeSet( ulPort, ucPins, GPIO_DIR_MODE_IN );

        /* */
        /* Set the pad(s) for analog operation. */
        /* */
        GPIOPadConfigSet( ulPort, ucPins, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_ANALOG );
    }
#endif /* if defined( GROUP_pintypecomparator ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Configures pin(s) for use by the I2C peripheral. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! */
/*! The I2C pins must be properly configured for the I2C peripheral to function */
/*! correctly.  This function provides the proper configuration for those pins. */
/*! */
/*! \note This cannot be used to turn any pin into an I2C pin; it only */
/*! configures an I2C pin for proper operation. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_pintypei2c ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPinTypeI2C( unsigned long ulPort,
                         unsigned char ucPins )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Make the pin(s) be peripheral controlled. */
        /* */
        GPIODirModeSet( ulPort, ucPins, GPIO_DIR_MODE_HW );

        /* */
        /* Set the pad(s) for open-drain operation with a weak pull-up. */
        /* */
        GPIOPadConfigSet( ulPort, ucPins, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_OD_WPU );
    }
#endif /* if defined( GROUP_pintypei2c ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Configures pin(s) for use by the PWM peripheral. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! */
/*! The PWM pins must be properly configured for the PWM peripheral to function */
/*! correctly.  This function provides a typical configuration for those pins; */
/*! other configurations may work as well depending upon the board setup (for */
/*! example, using the on-chip pull-ups). */
/*! */
/*! \note This cannot be used to turn any pin into a PWM pin; it only */
/*! configures a PWM pin for proper operation. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_pintypepwm ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPinTypePWM( unsigned long ulPort,
                         unsigned char ucPins )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Make the pin(s) be peripheral controlled. */
        /* */
        GPIODirModeSet( ulPort, ucPins, GPIO_DIR_MODE_HW );

        /* */
        /* Set the pad(s) for standard push-pull operation. */
        /* */
        GPIOPadConfigSet( ulPort, ucPins, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD );
    }
#endif /* if defined( GROUP_pintypepwm ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Configures pin(s) for use by the QEI peripheral. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! */
/*! The QEI pins must be properly configured for the QEI peripheral to function */
/*! correctly.  This function provides a typical configuration for those pins; */
/*! other configurations may work as well depending upon the board setup (for */
/*! example, not using the on-chip pull-ups). */
/*! */
/*! \note This cannot be used to turn any pin into a QEI pin; it only */
/*! configures a QEI pin for proper operation. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_pintypeqei ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPinTypeQEI( unsigned long ulPort,
                         unsigned char ucPins )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Make the pin(s) be peripheral controlled. */
        /* */
        GPIODirModeSet( ulPort, ucPins, GPIO_DIR_MODE_HW );

        /* */
        /* Set the pad(s) for standard push-pull operation with a weak pull-up. */
        /* */
        GPIOPadConfigSet( ulPort, ucPins, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU );
    }
#endif /* if defined( GROUP_pintypeqei ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Configures pin(s) for use by the SSI peripheral. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! */
/*! The SSI pins must be properly configured for the SSI peripheral to function */
/*! correctly.  This function provides a typical configuration for those pins; */
/*! other configurations may work as well depending upon the board setup (for */
/*! example, using the on-chip pull-ups). */
/*! */
/*! \note This cannot be used to turn any pin into a SSI pin; it only */
/*! configures a SSI pin for proper operation. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_pintypessi ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPinTypeSSI( unsigned long ulPort,
                         unsigned char ucPins )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Make the pin(s) be peripheral controlled. */
        /* */
        GPIODirModeSet( ulPort, ucPins, GPIO_DIR_MODE_HW );

        /* */
        /* Set the pad(s) for standard push-pull operation. */
        /* */
        GPIOPadConfigSet( ulPort, ucPins, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD );
    }
#endif /* if defined( GROUP_pintypessi ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Configures pin(s) for use by the Timer peripheral. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! */
/*! The CCP pins must be properly configured for the timer peripheral to */
/*! function correctly.  This function provides a typical configuration for */
/*! those pins; other configurations may work as well depending upon the board */
/*! setup (for example, using the on-chip pull-ups). */
/*! */
/*! \note This cannot be used to turn any pin into a timer pin; it only */
/*! configures a timer pin for proper operation. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_pintypetimer ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPinTypeTimer( unsigned long ulPort,
                           unsigned char ucPins )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Make the pin(s) be peripheral controlled. */
        /* */
        GPIODirModeSet( ulPort, ucPins, GPIO_DIR_MODE_HW );

        /* */
        /* Set the pad(s) for standard push-pull operation. */
        /* */
        GPIOPadConfigSet( ulPort, ucPins, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD );
    }
#endif /* if defined( GROUP_pintypetimer ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Configures pin(s) for use by the UART peripheral. */
/*! */
/*! \param ulPort base address of the selected GPIO port */
/*! \param ucPins bit-packed representation of the specified pins */
/*! */
/*! The UART pins must be properly configured for the UART peripheral to */
/*! function correctly.  This function provides a typical configuration for */
/*! those pins; other configurations may work as well depending upon the board */
/*! setup (for example, using the on-chip pull-ups). */
/*! */
/*! \note This cannot be used to turn any pin into a UART pin; it only */
/*! configures a UART pin for proper operation. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_pintypeuart ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void GPIOPinTypeUART( unsigned long ulPort,
                          unsigned char ucPins )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ( ulPort == GPIO_PORTA_BASE ) || ( ulPort == GPIO_PORTB_BASE ) ||
                ( ulPort == GPIO_PORTC_BASE ) || ( ulPort == GPIO_PORTD_BASE ) ||
                ( ulPort == GPIO_PORTE_BASE ) );

        /* */
        /* Make the pin(s) be peripheral controlled. */
        /* */
        GPIODirModeSet( ulPort, ucPins, GPIO_DIR_MODE_HW );

        /* */
        /* Set the pad(s) for standard push-pull operation. */
        /* */
        GPIOPadConfigSet( ulPort, ucPins, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD );
    }
#endif /* if defined( GROUP_pintypeuart ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/* Close the Doxygen group. */
/*! @} */
/* */
/****************************************************************************** */
